---
kind: property
id: P:Autodesk.Revit.DB.Lighting.LineLightShape.EmitLength
source: html/ab565bc6-7ad8-cbdd-cfe3-442f1f344804.htm
---
# Autodesk.Revit.DB.Lighting.LineLightShape.EmitLength Property

The emit length.

## Syntax (C#)
```csharp
public double EmitLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.